spec/vcr/xendit/ewallet/ovo/get_complete_payment.yml

---
http_interactions:
- request:
    method: get
    uri: https://api.xendit.co/ewallets/charges/ewc_b66bb767-be7e-4247-8a75-2a970a749e46
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Authorization:
      - Basic eG5kX2RldmVsb3BtZW50X0lNN2NzeUc0bTNjeVBPVWJwUG02VU51MHozWmtBZXNGR3dnbXVjdXk4NFBRS1NSS2xuWUdlNllqMkphNVVtQjo=
      User-Agent:
      - Faraday v1.3.0
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - no-store, no-cache, must-revalidate, proxy-revalidate
      Content-Type:
      - application/json; charset=UTF-8
      Date:
      - Fri, 18 Jun 2021 00:18:30 GMT
      Expires:
      - '0'
      Pragma:
      - no-cache
      Server:
      - nginx
      Strict-Transport-Security:
      - max-age=2592000; includeSubDomains
      Surrogate-Control:
      - no-store
      Connection:
      - keep-alive
      Set-Cookie:
      - incap_ses_1116_2182539=N6dQdgAibDjBMl3LbtR8D1Xmy2AAAAAAqtrYpmNcmZ2FByvMl1ik9Q==;
        path=/; Domain=.xendit.co
      - nlbi_2182539=bmToBPCVb0bRhj1MjjCKbQAAAADO7SViCLJGqQxP3jXP//yD; path=/; Domain=.xendit.co
      - visid_incap_2182539=chigP9bSROekL0B3hs9iRFTmy2AAAAAAQUIPAAAAAAAV7vEWj0t9prTgXbu9V6pQ;
        expires=Fri, 17 Jun 2022 09:15:12 GMT; HttpOnly; path=/; Domain=.xendit.co
      X-Cdn:
      - Imperva
      Transfer-Encoding:
      - chunked
      X-Iinfo:
      - 5-1163102-1157195 pNYN RT(1623975508550 80) q(0 0 0 0) r(12 12) U16
    body:
      encoding: ASCII-8BIT
      string: '{"id":"ewc_b66bb767-be7e-4247-8a75-2a970a749e46","business_id":"12121212","reference_id":"nobu@mekari.com","status":"SUCCEEDED","currency":"IDR","charge_amount":1000,"capture_amount":1000,"refunded_amount":null,"checkout_method":"ONE_TIME_PAYMENT","channel_code":"ID_OVO","channel_properties":{"mobile_number":"+6281234567890"},"actions":null,"is_redirect_required":false,"callback_url":"https://webhook.site/6eef288c-e4ac-4b1b-a453-bbdde612af6b","created":"2021-06-17T03:26:11.253Z","updated":"2021-06-17T03:26:11.263Z","void_status":null,"voided_at":null,"capture_now":true,"customer_id":null,"payment_method_id":null,"failure_code":null,"basket":null,"metadata":null}

'
  recorded_at: Fri, 18 Jun 2021 00:18:30 GMT
recorded_with: VCR 6.0.0
